/*Да се напише функция, която получава час и минути от 24-часово денонощие 
и изчислява колко ще е часът след 15 минути. Резултатът да се отпечата 
във формат часове:минути. Часовете винаги са между 0 и 23, а минутите винаги са между 0 и 59. Часовете 
се изписват с една или две цифри. Минутите се изписват винаги с по две цифри,
 с водеща нула, когато е необходимо. */

 function solution(arg1,arg2)
 {
    let hour=Number(arg1);
    let minutes=Number(arg2);
    minutes+=15
    if(minutes>=60)
    {
        hour+=1;
        minutes%=60;
    }
    if(hour>=24)
    {
        hour*=0;
    }
    if (minutes<10)
    {
        console.log(`${hour}:0${minutes}`)
    }
    else
    {
    console.log(`${hour}:${minutes}`);
    }


 }
 solution("23", "45")
